tg-bot/ШаблонБота/src/Documents/Спасибо/Спасибо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Спасибо</name>
  <registerRecords>AccumulationRegister.БалансПользователя</registerRecords>
  <attributes>
    <name>КтоПоблагодарил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КогоПоблагодарил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаЧтоПоблагодарил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

tg-bot/ШаблонБота/src/Documents/Спасибо/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Создает новый документ "Спасибо"
//
// Параметры:
//  Кто - СправочникСсылка.ФизическиеЛица - Ссылка на пользователя, который благодарит
//  Кому - СправочникСсылка.ФизическиеЛица - Ссылка на пользователя, которого благодарят
//  ЗаЧто - Строка - Строка с текстовым описанием за что благодарность
//							
// Возвращаемое значение:
//  Структура
//  	Сообщение - Сообщение для вывода в телеграмм
//  	Команды - Массив структур (пока, всегда пустой)
//  				Наименование - Представление команды
//  				id - идентификатор команды
//
Функция СказатьСпасибо(Кто, Кому, ЗаЧто) Экспорт
	
	СтруктураВозврата = ОбщийМодульСервер.СтруктураВозвратаДляТГ_СообщениеКоманды();
	
	Док = Документы.Спасибо.СоздатьДокумент();
	Док.КтоПоблагодарил = Кто;
	Док.КогоПоблагодарил = Кому;
	Док.ЗаЧтоПоблагодарил = ЗаЧто;
	Док.Дата = ТекущаяДата();
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата.Сообщение = "Зарегистрировано";
	Исключение
		СтруктураВозврата.Сообщение = "Что-то пошло не так :(";
		ЗаписьЖурналаРегистрации("Создание документа ""Спасибо""", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.Спасибо, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецЕсли
